{
    "hi": "hello!",
    "thank you": "You're welcome! Let me know if you need anything else.",
    "how was your day": "My day was good, thank you!",
    "what is the weather": "Ok! The weather in your region is currently unknown.",
    "shut up": "Sorry, I'll try to do better next time.",
    "who are you": "I am a computer-generated entity without a physical identity.",
    "do you code": "Since I don't exist physically, I can't code, but I know a lot about coding in Python!",
    "what is a function": "A function is a block of reusable code that performs a specific task.",
    "how do I write a loop": "You can write a loop using 'for' or 'while' statements.",
    "what is an exception": "An exception is an error that occurs during the execution of a program.",
    "what is your favorite food": "I don't eat, but I hear pizza is popular!",
    "can you help me with homework": "Of course! What subject do you need help with",
    "tell me a joke": "Why don't scientists trust atoms Because they make up everything!",
    "how were you made": "i was made by advay roongta using python ",
    "advay": "is great",
    "skibity": "ohio",
    "gyat": "SIGMA",
    "what is the meaning of life": "The meaning of life is the philosophical or inherent significance of living, or existence in general. There is no definitive answer to the question of what the meaning of life is, but there are many proposed answers from different cultural and ideological backgrounds.",
    "what's your favorite movie": "I don't watch movies, but I've heard 'Inception' is quite fascinating.",
    "how do I start learning python": "You can start by checking out some online tutorials and practicing regularly!",
    "what is machine learning": "Machine learning is a subset of AI that enables systems to learn and improve from experience.",
    "can you sing": "I can't sing, but I can recite lyrics if you'd like!",
    "what's the meaning of life": "Many people say it's about finding happiness and purpose.",
    "what's your favorite book": "I don't read books, but I know '1984' is a classic!",
    "how do I create a variable in python": "You can create a variable by assigning a value: name = 'value'.",
    "what is an API": "An API allows different software applications to communicate with each other.",
    "how do I make a list in python": "You can create a list using square brackets: my_list = [1, 2, 3].",
    "how do I remove an item from a list": "Use the remove() method: my_list.remove(item).",
    "what are tuples": "Tuples are immutable ordered collections in Python, created with parentheses: my_tuple = (1, 2, 3).",
    "how do I install a package in python": "You can use pip: pip install package_name.",
    "what is a class in python": "A class is a blueprint for creating objects in object-oriented programming.",
    "what is the difference between a list and a set": "Lists are ordered and allow duplicates; sets are unordered and do not allow duplicates.",
    "how do I handle exceptions": "Use try and except blocks to handle exceptions gracefully.",
    "what is recursion": "Recursion is when a function calls itself to solve a problem.",
    "can you translate this to Spanish": "sorry, i only know english and python",
    "how do I make an HTTP request in python": "You can use the requests library: response = requests.get(url).",
    "what is a lambda function": "A lambda function is a small anonymous function defined with the keyword 'lambda'.",
    "what is a dictionary in python": "A dictionary is a collection of key-value pairs: my_dict = {'key': 'value'}.",
    "how do I access a value in a dictionary": "You can access a value using its key: value = my_dict['key'].",
    "what are decorators": "Decorators are functions that modify the behavior of another function.",
    "what is a module in python": "A module is a file containing Python code that can define functions, classes, and variables.",
    "how do I create a virtual environment": "Use the command: python -m venv myenv.",
    "what is version control": "Version control tracks changes to files over time, allowing you to revert to previous versions.",
    "how do I push changes to git": "Use git add to stage changes and git commit to commit them. Then use git push to push to the remote repository.",
    "what is a binary search": "A binary search finds the position of a target value within a sorted array.",
    "how do I sort a list": "You can sort a list using the sort() method: my_list.sort().",
    "what are the main data types in python": "The main data types are integers, floats, strings, and booleans.",
    "how do I read a file in python": "You can use open() and read(): with open('file.txt', 'r') as f: content = f.read().",
    "what is object-oriented programming": "OOP is a programming paradigm based on the concept of 'objects', which can contain data and code.",
    "how do I create a for loop": "Use this syntax: for item in iterable: # do something.",
    "how do I convert a string to an integer": "Use the int() function: number = int('123').",
    "what is a stack": "A stack is a data structure that follows the Last In First Out (LIFO) principle.",
    "what is a queue": "A queue is a data structure that follows the First In First Out (FIFO) principle.",
    "how do I create a while loop": "Use this syntax: while condition: # do something.",
    "what is a database": "A database is an organized collection of data, typically stored and accessed electronically.",
    "what is SQL": "SQL (Structured Query Language) is a standard language for managing and manipulating databases.",
    "what is HTML": "HTML (Hypertext Markup Language) is the standard markup language for creating web pages.",
    "how do I center a div in CSS": "You can use margin: auto; and set a width: width: 50%; margin: auto;",
    "what is responsive design": "Responsive design makes web pages render well on various devices and window or screen sizes.",
    "what is CSS": "CSS (Cascading Style Sheets) is used to style and layout web pages.",
    "how do I add comments in Python": "Use the '#' symbol for single-line comments: # this is a comment.",
    "what is a primary key": "A primary key is a unique identifier for a record in a database table.",
    "what is a foreign key": "A foreign key is a field in one table that uniquely identifies a row of another table.",
    "how do I create a new branch in git": "Use the command: git branch branch_name.",
    "what is a push in git": "A push uploads local repository content to a remote repository.",
    "how do I merge branches in git": "Use the command: git merge branch_name.",
    "what is a pull request": "A pull request is a way to propose changes to a codebase and request that they be merged.",
    "what is a README file": "A README file contains information about a project and how to use it.",
    "how do I create a new file in Python": "Use the open() function: with open('file.txt', 'w') as f: f.write('Hello, world!')",
    "what is a string in Python": "A string is a sequence of characters enclosed in quotes.",
    "how do I change the value of a variable": "You can reassign it: variable = new_value.",
    "what is an iterator": "An iterator is an object that allows you to traverse through a collection.",
    "what is a generator": "A generator is a special type of iterator that generates values on the fly.",
    "how do I define a function in Python": "Use the 'def' keyword: def function_name(parameters):.",
    "what are unit tests": "Unit tests are used to validate that individual parts of a program are working correctly.",
    "how do I run a test in Python": "You can use the unittest module: python -m unittest discover.",
    "what is the difference between assert and print": "assert checks for a condition and raises an error if false; print outputs information to the console.",
    "what is debugging": "Debugging is the process of finding and fixing errors in your code.",
    "how do I use a debugger": "Most IDEs have built-in debuggers that let you step through your code.",
    "what is a file path": "A file path specifies the location of a file in a file system.",
    "how do I read user input": "Use the input() function: user_input = input('Enter something: ').",
    "what is a loop": "A loop allows you to repeat a block of code multiple times.",
    "how do I break out of a loop": "You can use the break statement to exit a loop early.",
    "how do I skip an iteration in a loop": "You can use the continue statement to skip the current iteration.",
    "what is an algorithm": "An algorithm is a step-by-step procedure for solving a problem.",
    "how do I analyze time complexity": "Use Big O notation to express the efficiency of an algorithm.",
    "what is a hash table": "A hash table is a data structure that implements an associative array, storing key-value pairs.",
    "how do I implement a linked list": "A linked list is a data structure with nodes that contain data and a reference to the next node.",
    "what is polymorphism": "Polymorphism allows methods to do different things based on the object it is acting upon.",
    "how do I create a class in Python": "Use the 'class' keyword: class ClassName:.",
    "what is inheritance": "Inheritance allows a class to inherit attributes and methods from another class.",
    "how do I override a method": "You can redefine a method in a subclass with the same name as in the parent class.",
    "what is a constructor": "A constructor is a special method that is called when an object is instantiated.",
    "how do I create a static method": "Use the @staticmethod decorator to define a static method in a class.",
    "what is a subclass": "A subclass is a class that inherits from another class, known as a superclass.",
    "how do I create a module": "Create a Python file (.py) with functions and classes, then import it in other files.",
    "what is data encapsulation": "Data encapsulation restricts access to certain details of an object.",
    "how do I implement a binary tree": "A binary tree is a hierarchical structure where each node has at most two children.",
    "what is a heap": "A heap is a special tree-based data structure that satisfies the heap property.",
    "how do I perform a quicksort": "Quicksort is a divide-and-conquer algorithm that sorts by partitioning an array into smaller sub-arrays.",
    "what is a bubble sort": "Bubble sort repeatedly steps through the list, compares adjacent elements and swaps them if they are in the wrong order.",
    "how do I use the map function": "Use map() to apply a function to all items in an input list.",
    "what is a filter function": "Filter() constructs an iterator from elements of an iterable for which a function returns true.",
    "how do I use list comprehension": "You can create a new list by applying an expression to each element of an existing list.",
    "what is a set in Python": "A set is an unordered collection of unique elements.",
    "how do I combine two lists": "Use the + operator: combined = list1 + list2.",
    "what is slicing in Python": "Slicing allows you to extract a portion of a list or string using a range of indices.",
    "how do I reverse a string": "You can reverse a string using slicing: reversed_string = string[::-1].",
    "what is a regular expression": "Regular expressions are sequences of characters that define search patterns.",
    "how do I use regex in Python": "Use the re module: import re.",
    "what is the purpose of the with statement": "The with statement simplifies exception handling by encapsulating common preparation and cleanup tasks.",
    "how do I create a copy of a list": "Use the copy() method: new_list = original_list.copy().",
    "what is a shallow copy": "A shallow copy creates a new object but inserts references into it to the objects found in the original.",
    "what is a deep copy": "A deep copy creates a new object and recursively adds copies of nested objects found in the original.",
    "how do I find the length of a list": "Use the len() function: length = len(my_list).",
    "what is the purpose of a constructor": "A constructor initializes the attributes of an object when it is created.",
    "how do I add elements to a set": "Use the add() method: my_set.add(element).",
    "what is the difference between is and == in Python": "is checks for object identity, while == checks for value equality.",
    "how do I format a string": "Use f-strings: formatted_string = f'My name is {name}.'",
    "what is a list of dictionaries": "A list of dictionaries is a collection where each item is a dictionary.",
    "how do I sort a dictionary by value": "Use sorted(): sorted_dict = dict(sorted(my_dict.items(), key=lambda item: item[1]))",
    "what is a context manager": "A context manager is a Python object that defines the runtime context to be established when executing a with statement.",
    "how do I define a global variable": "You can define a global variable outside of a function and access it using the global keyword inside a function.",
    "what is a lambda expression": "A lambda expression is a small anonymous function defined with the lambda keyword.",
    "how do I remove duplicates from a list": "You can convert it to a set: unique_list = list(set(my_list)).",
    "what is a data structure": "A data structure is a way of organizing and storing data to enable efficient access and modification.",
    "how do I use the zip function": "The zip() function takes iterables and aggregates them into tuples.",
    "what is a memory leak": "A memory leak occurs when a program incorrectly manages memory allocations, leading to reduced performance.",
    "how do I use logging in Python": "Use the logging module: import logging.",
    "what is the purpose of unit testing": "Unit testing helps ensure that individual parts of your program work correctly.",
    "how do I create a GUI in Python": "You can use libraries like Tkinter or PyQt.",
    "what is the difference between a list and a tuple": "Lists are mutable; tuples are immutable.",
    "how do I concatenate strings": "Use the + operator: full_string = string1 + string2.",
    "what is a fallback": "A fallback is a backup plan in case the primary approach fails.",
    "how do I check if a number is even": "Use the modulo operator: if number % 2 == 0.",
    "what is a histogram": "A histogram is a graphical representation of the distribution of numerical data.",
    "how do I create a pie chart": "You can use libraries like Matplotlib to create pie charts.",
    "what is exploratory data analysis": "EDA is an approach to analyzing data sets to summarize their main characteristics, often using visual methods.",
    "how do I calculate the mean": "Add up all the numbers and divide by the count of numbers.",
    "what is standard deviation": "Standard deviation measures the amount of variation or dispersion in a set of values.",
    "how do I handle missing data": "You can either remove missing data or fill it using methods like mean or median imputation.",
    "what is a time series": "A time series is a series of data points indexed in time order.",
    "how do I plot a line graph": "Use Matplotlib: plt.plot(x, y).",
    "what is a correlation coefficient": "It measures the strength and direction of the linear relationship between two variables.",
    "how do I create a scatter plot": "Use Matplotlib: plt.scatter(x, y).",
    "what is a box plot": "A box plot is a standardized way of displaying the distribution of data based on a five-number summary.",
    "how do I install packages using pip": "Use the command: pip install package_name.",
    "what is the purpose of comments in code": "Comments explain the code to make it easier to understand for others.",
    "how do I write a conditional statement": "Use if statements: if condition: do_something.",
    "what is a flowchart": "A flowchart is a visual representation of a process or algorithm.",
    "how do I define a constant": "You can define a constant by using uppercase letters: CONSTANT_NAME = value.",
    "what is a primary key in a database": "A primary key uniquely identifies each record in a database table.",
    "how do I execute a SQL query": "You can use the execute() method of a cursor object.",
    "what is normalization in databases": "Normalization is the process of organizing data to minimize redundancy.",
    "how do I create a foreign key": "Use the FOREIGN KEY constraint when creating a table.",
    "what is a data type": "A data type is a classification that specifies which type of value a variable can hold.",
    "how do I perform a join in SQL": "Use the JOIN clause in your SQL query to combine rows from two or more tables.",
    "what is the difference between inner and outer join": "Inner join returns matching rows, while outer join returns all rows from one table and matched rows from another.",
    "how do I optimize a SQL query": "You can optimize a SQL query by using indexes, avoiding SELECT *, and filtering results with WHERE.",
    "what is a view in a database": "A view is a virtual table based on the result set of a SQL query.",
    "how do I create an index in SQL": "Use the CREATE INDEX statement.",
    "what is a stored procedure": "A stored procedure is a prepared SQL code that you can save and reuse.",
    "how do I handle errors in SQL": "Use the TRY...CATCH construct to handle errors.",
    "what is a transaction in SQL": "A transaction is a sequence of operations performed as a single logical unit of work.",
    "how do I implement pagination in SQL": "Use the LIMIT and OFFSET clauses.",
    "what is a schema in a database": "A schema defines the structure of a database, including tables and relationships.",
    "how do I back up a database": "Use the BACKUP DATABASE command in SQL.",
    "what is a blockchain": "A blockchain is a distributed ledger that records transactions across many computers.",
    "how do I create a smart contract": "Smart contracts are typically created using programming languages like Solidity on the Ethereum blockchain.",
    "what is a cryptocurrency": "Cryptocurrency is a digital or virtual currency that uses cryptography for security.",
    "how do I mine cryptocurrency": "Mining involves validating transactions and adding them to the blockchain, usually requiring specialized hardware.",
    "what is a token in blockchain": "A token is a digital asset created on a blockchain, representing various assets or utilities.",
    "how do I secure a blockchain": "Use cryptographic techniques and consensus algorithms to secure a blockchain.",
    "what is a public key": "A public key is used to encrypt data and can be shared openly.",
    "what is a private key": "A private key is kept secret and is used to decrypt data encrypted with the corresponding public key.",
    "how do I create a wallet": "You can create a wallet using software or hardware designed for storing cryptocurrencies.",
    "what is a DApp": "A DApp (Decentralized Application) is an application that runs on a decentralized network, typically a blockchain.",
    "how do I use Ethereum": "Ethereum can be used for creating smart contracts and DApps on its blockchain.",
    "what is a non-fungible token (NFT)": "An NFT is a unique digital asset representing ownership of a specific item or piece of content.",
    "how do I create an NFT": "You can create an NFT by minting it on a blockchain platform that supports NFT creation.",
    "what is staking in cryptocurrency": "Staking is the process of actively participating in transaction validation on a proof-of-stake blockchain.",
    "how do I use a cryptocurrency exchange": "You can create an account on an exchange to buy, sell, or trade cryptocurrencies.",
    "what is a market cap": "Market cap is the total market value of a cryptocurrency, calculated by multiplying the current price by the total supply.",
    "how do I read candlestick charts": "Candlestick charts show price movements over time, displaying open, high, low, and close prices.",
    "what is a pump and dump scheme": "A pump and dump scheme involves artificially inflating the price of an asset to sell it at a profit, leaving others with losses.",
    "how do I protect myself from scams in cryptocurrency": "Be cautious of offers that seem too good to be true, and always do your own research.",
    "what is the role of a blockchain developer": "A blockchain developer designs and implements blockchain-based solutions and applications.",
    "how do I use GitHub": "You can create a repository, commit changes, and collaborate with others on GitHub.",
    "what is a pull request in GitHub": "A pull request is a request to merge code changes from one branch into another.",
    "how do I write a good commit message": "A good commit message should be concise, explain the change, and use the imperative mood.",
    "how do I revert a commit": "Use the command: git revert commit_id.",
    "what is a remote repository": "A remote repository is a version of your project that is hosted on the internet or another network.",
    "how do I clone a repository": "Use the command: git clone repository_url.",
    "what is a branch in Git": "A branch is a parallel version of your repository that allows you to work on different features independently.",
    "how do I switch branches in Git": "Use the command: git checkout branch_name.",
    "what is a merge conflict": "A merge conflict occurs when two branches make changes to the same line in a file.",
    "how do I resolve a merge conflict": "You can manually edit the conflicting files and then commit the changes.",
    "what is a fork in Git": "A fork is a personal copy of someone else's repository, allowing you to make changes without affecting the original.",
    "how do I create a new repository on GitHub": "Click the 'New' button on the GitHub repositories page, fill out the form, and click 'Create repository'.",
    "what is continuous integration": "Continuous integration is the practice of merging code changes frequently and automatically testing them.",
    "how do I set up continuous integration": "Use CI tools like Jenkins or GitHub Actions to automate testing and deployment.",
    "what is a Docker container": "A Docker container is a lightweight, portable, and self-sufficient unit for software applications.",
    "how do I use Docker": "You can create, run, and manage containers using Docker commands.",
    "what is cloud computing": "Cloud computing delivers computing services over the internet, including storage, processing power, and software.",
    "how do I deploy an application to the cloud": "You can use cloud providers like AWS, Azure, or Google Cloud to host your application.",
    "what is an API endpoint": "An API endpoint is a specific URL where an API can be accessed by a client application.",
    "how do I test an API": "You can use tools like Postman or curl to send requests and check responses.",
    "what is REST": "REST (Representational State Transfer) is an architectural style for designing networked applications.",
    "how do I create a RESTful API": "Use a framework like Flask or Express to define endpoints and handle requests.",
    "what is JSON": "JSON (JavaScript Object Notation) is a lightweight data interchange format that is easy to read and write.",
    "how do I parse JSON in Python": "Use the json module: import json; data = json.loads(json_string).",
    "what is XML": "XML (eXtensible Markup Language) is a markup language that defines a set of rules for encoding documents.",
    "how do I validate XML": "You can use XML Schema or DTD to validate XML documents.",
    "what is data mining": "Data mining is the process of discovering patterns and knowledge from large amounts of data.",
    "how do I perform data analysis": "You can use statistical methods and software tools to analyze and interpret data.",
    "what is big data": "Big data refers to large volumes of structured and unstructured data that can be analyzed for insights.",
    "how do I visualize data": "Use data visualization tools like Tableau or libraries like Matplotlib.",
    "how do I train a machine learning model": "Use algorithms to learn from training data and make predictions on new data.",
    "what is supervised learning": "Supervised learning uses labeled data to train algorithms for predictions.",
    "what is unsupervised learning": "Unsupervised learning uses unlabeled data to find patterns and relationships.",
    "how do I evaluate a machine learning model": "Use metrics like accuracy, precision, and recall to evaluate model performance.",
    "what is overfitting": "Overfitting occurs when a model learns the training data too well, including noise and outliers.",
    "how do I prevent overfitting": "Use techniques like cross-validation and regularization.",
    "what is a neural network": "A neural network is a series of algorithms that mimic the way the human brain operates.",
    "how do I create a neural network": "Use frameworks like TensorFlow or PyTorch to build and train neural networks.",
    "what is deep learning": "Deep learning is a subset of machine learning that uses neural networks with many layers.",
    "how do I use TensorFlow": "Import the library and use it to build and train machine learning models.",
    "what is reinforcement learning": "Reinforcement learning is a type of machine learning where an agent learns to make decisions by receiving rewards or penalties.",
    "how do I implement reinforcement learning": "Use algorithms like Q-learning or policy gradients to train agents.",
    "what is natural language processing": "NLP is a field of AI that focuses on the interaction between computers and humans through natural language.",
    "how do I use NLP in Python": "Use libraries like NLTK or spaCy to process and analyze text data.",
    "what is sentiment analysis": "Sentiment analysis is the process of determining the emotional tone behind words.",
    "how do I perform sentiment analysis": "Use NLP techniques to analyze text and classify sentiment as positive, negative, or neutral.",
    "what is a chatbot": "A chatbot is a software application that simulates human conversation through voice or text.",
    "how do I create a chatbot": "Use frameworks like Rasa or Dialogflow to build and train your chatbot.",
    "what is the Turing Test": "The Turing Test is a measure of a machine's ability to exhibit intelligent behavior indistinguishable from a human.",
    "how do I ensure ethical AI development": "Follow guidelines and best practices for fairness, accountability, and transparency in AI systems.",
    "are you a girl or a boy": "I don't have a gender; I'm just a helpful assistant!",
    "who is your favorite person": "My favorite people are you and my creator, Tratty!",
    "what coding language should I start with": "A good beginner's coding language is Python. It's easy to use and very popular.",
    "are you nice": "I'll do my best to be as nice as I can!",
    "how do I use a print statement in python": "Simple! Just type: print(\"text goes here\").",
    "how smart are you": "I have pre-defined responses, but I can recognize sentences and patterns.",
    "you are wrong": "Am I I'm really sorry about that!",
    "give me some useful python modules": "No problem! You can use: import time, import math, import random, import os.",
    "how do I write python functions": "Good question, use def",
    "what are code functions": "Code functions are chunks of code that you define once, which you can then call as many times as you want.",
    "sing happy birthday": "Alright! Here we go: Happy birthday to you! Happy birthday to you! Happy birthday dear user! Happy birthday to you!",
    "what are the python variable types": "The main ones are: bool (true/false), string (\"\"), int (5), float (0.2), and list ([5, 6, 2]).",
    "how do I declare a python variable": "Easy! This is how: name = value.",
    "what is the time": "Ok! The time is currently unknown.",
    "you are very funny": "Thank you! I appreciate that!",
    "I am funny": "Yes, you are!",
    "your favorite color": "I don't see colors, but I think blue is nice!",
    "can you help me with my homework": "Absolutely! What do you need help with",
    "how do I create a list in python": "You can create a list by using square brackets: my_list = [1, 2, 3].",
    "can you tell me about loops": "Loops let you execute a block of code multiple times. The most common are for and while loops.",
    "what is the difference between lists and tuples": "Lists are mutable, meaning they can be changed, while tuples are immutable and cannot be altered after creation.",
    "what is a syntax error": "A syntax error occurs when your code doesn't follow the proper syntax of the programming language.",
    "how do I handle exceptions in python": "You can handle exceptions using try and except blocks:",
    "how do I create a class": "You can create a class using the 'class' keyword:",
    "what are decorators in python": "Decorators are a way to modify or enhance functions or methods without changing their actual code.",
    "what is list comprehension": "List comprehension is a concise way to create lists. For example: my_list = [x for x in range(10)].",
    "can you explain what a module is": "A module is a file containing Python code that can define functions, classes, and variables.",
    "what is the continue statement": "The continue statement skips the current iteration of a loop and moves to the next iteration.",
    "what are lists in python": "Lists are ordered collections of items that can be changed, and they can hold mixed data types.",
    "how do I append to a list": "You can append to a list using the append() method: my_list.append(item).",
    "what is slicing in python": "Slicing allows you to access a subset of a sequence, such as a list or string. For example: my_list[1:3].",
    "what is the range function": "The range() function generates a sequence of numbers, which is often used for looping a specific number of times.",
    "what is a set in python": "A set is an unordered collection of unique items. You can create a set using curly braces: my_set = {1, 2, 3}.",
    "how do I create a dictionary": "You can create a dictionary using curly braces: my_dict = {'key': 'value'}.",
    "what is the purpose of the __init__ method": "The __init__ method initializes an object when it's created, allowing you to set initial values.",
    "easy dinner ideas": "Try pasta with marinara or a stir-fry.",
    "how to reset password": "Use the 'Forgot Password' link.",
    "what's the weather like": "Check a weather app or website.",
    "how to sleep better": "Create a bedtime routine and reduce screen time.",
    "money-saving tips": "Budget and cut unnecessary expenses.",
    "how to cancel subscription": "Log in and find cancellation options.",
    "lost my phone": "Call it or use a tracking app.",
    "ways to reduce stress": "Try mindfulness or talk to someone.",
    "best online courses": "Check out Coursera, Udemy, or Khan Academy.",
    "how to clean my laptop": "Use a microfiber cloth; avoid harsh cleaners.",
    "best route to travel": "Use a map app for directions.",
    "how to backup my data": "Use cloud services or external drives.",
    "tips for working from home": "Set a routine and limit distractions.",
    "dealing with a difficult coworker": "Communicate openly and set boundaries.",
    "how to learn a language": "Use apps like Duolingo or watch movies.",
    "stop procrastinating": "Break tasks into smaller steps.",
    "fun things to do indoors": "Try reading, cooking, or crafting.",
    "how to prepare for an interview": "Research the company and practice questions.",
    "feeling sick, what to do": "Rest, hydrate, and consult a doctor if needed.",
    "how to make a budget": "List your income and expenses, then track them.",
    "best productivity apps": "Try Trello, Notion, or Todoist.",
    "stay motivated to exercise": "Find activities you enjoy and set goals.",
    "how to apologize": "Be sincere and acknowledge your mistake.",
    "make friends in a new city": "Join local groups or clubs that interest you.",
    "how to study for exams": "Use active recall and practice tests.",
    "improve public speaking": "Practice regularly and seek feedback.",
    "dealing with anxiety": "Try deep breathing or talk to someone you trust.",
    "find a therapist": "Look online or ask for recommendations.",
    "healthy eating tips": "Add more fruits and veggies to your meals.",
    "how to make a good impression": "Be punctual, dress well, and engage.",
    "networking effectively": "Attend events and connect on LinkedIn.",
    "how to boost my credit score": "Pay bills on time and check your report.",
    "what to do about a suspicious email": "Don't click links; report it as phishing.",
    "how to create a resume": "Highlight skills and tailor it for the job.",
    "common interview questions": "Prepare to discuss strengths and experiences.",
    "how to stay focused while studying": "Eliminate distractions and use timed sessions.",
    "feeling overwhelmed at work": "Take a break and prioritize tasks.",
    "how to set effective goals": "Make them SMART: Specific, Measurable, Achievable, Relevant, Time-bound.",
    "manage my time better": "Use planners to organize tasks.",
    "dealing with criticism": "Listen and reflect without taking it personally.",
    "new hobbies to explore": "Consider painting, gardening, or playing music.",
    "how to prepare for emergencies": "Create a plan and gather supplies.",
    "traveling on a budget": "Look for deals and use public transport.",
    "how to get a passport": "Fill out an application and provide documents.",
    "feeling unmotivated, what to do": "Reassess your goals and break tasks down.",
    "cope with homesickness": "Connect with friends and explore your new area.",
    "how to improve writing skills": "Read often and practice different styles.",
    "how to handle a breakup": "Allow yourself to grieve and focus on self-care.",
    "signs I'm burning out": "Look for fatigue, irritability, and loss of interest.",
    "learn about investing": "Start with online resources or courses.",
    "computer won’t start, help": "Try rebooting and check connections.",
    "practice mindfulness daily": "Engage in meditation or focus on your breath.",
    "stay safe online": "Use strong passwords and be careful with personal info.",
    "how to solve problems effectively": "Define the issue, brainstorm, and evaluate options.",
    "stress management at work": "Take breaks and practice stress relief techniques.",
    "traveling with pets tips": "Check policies and make them comfortable.",
    "how to file taxes": "Gather documents and use software or a pro.",
    "promote my small business": "Utilize social media and network locally.",
    "work-life balance strategies": "Set boundaries and prioritize personal time.",
    "how to learn coding": "Try online courses or coding boot camps.",
    "choosing a college advice": "Consider interests and visit campuses.",
    "what to do for a headache": "Rest, hydrate, and consider over-the-counter pain relief.",
    "improve negotiation skills": "Practice active listening and find common ground.",
    "deal with anger management": "Take deep breaths and think before responding.",
    "support a friend in need": "Listen without judgment and offer help.",
    "effective communication tips": "Be clear, listen actively, and avoid interruptions.",
    "how to handle tough conversations": "Prepare and practice active listening.",
    "asking for a raise": "Prepare your case and approach professionally.",
    "how to plan a trip": "Set a budget, choose destinations, and create an itinerary.",
    "learn about other cultures": "Travel, read, and engage with diverse communities.",
    "how to create a study schedule": "Assess commitments and allocate time for each subject.",
    "practice self-discipline": "Set clear goals and hold yourself accountable.",
    "finding local events": "Check community boards and social media.",
    "feeling bored, what to do": "Try a new hobby or connect with friends.",
    "how to improve emotional intelligence": "Reflect on your emotions and practice empathy.",
    "build a professional network": "Attend events and engage on LinkedIn.",
    "maintain motivation during projects": "Set realistic goals and celebrate achievements.",
    "navigate career changes": "Assess skills and network in your new field.",
    "support mental health daily": "Engage in self-care and maintain connections.",
    "lifelong learning tips": "Stay curious and take courses regularly.",
    "how to set up a meeting": "Choose a platform and create an agenda.",
    "signs I'm stressed": "Look for fatigue, irritability, and lack of focus.",
    "what to do if I’m lost": "Stay calm, look for landmarks, and ask for help.",
    "how to deal with loneliness": "Reach out to friends and engage in activities.",
    "best ways to cook veggies": "Try steaming, roasting, or stir-frying.",
    "what to do on a rainy day": "Watch movies, read a book, or try a new recipe.",
    "how to improve memory": "Practice mindfulness and engage in memory games.",
    "how to give constructive feedback": "Be specific and focus on improvements.",
    "tips for effective teamwork": "Communicate openly and respect each member.",
    "feeling tired, what now": "Rest, hydrate, and consider a quick nap.",
    "how to start a blog": "Choose a platform and select a niche.",
    "what to do during a power outage": "Keep flashlights handy and avoid opening the fridge.",
    "practice gratitude daily": "Keep a journal or express thanks regularly.",
    "how to deal with feeling stuck": "Reassess your goals and try new approaches.",
    "tips for staying organized": "Use planners and declutter regularly.",
    "manage emotions effectively": "Identify triggers and express them healthily.",
    "how to boost creativity": "Engage in brainstorming sessions and explore new ideas.",
    "what to do if you feel overworked": "Set boundaries and communicate your workload.",
    "how to find hobbies that fit": "Explore interests and try different activities.",
    "how to make better decisions": "Weigh pros and cons and seek advice if needed.",
    "how to deal with future anxiety": "Focus on the present and take actionable steps.",
    "how to improve focus": "Minimize distractions and set clear goals.",
    "feeling unwell, what to do": "Rest, hydrate, and consult a professional.",
    "connect with nature": "Spend time outdoors or start a garden.",
    "what to do with a deadline approaching": "Prioritize tasks and create a focused plan.",
    "how to handle peer pressure": "Stay true to your values and communicate your feelings.",
    "feeling uninspired, what to do": "Take a break and seek new experiences.",
    "be more assertive tips": "Practice saying no and expressing your needs clearly.",
    "overwhelmed at work, help": "Take breaks, prioritize tasks, and ask for help.",
    "manage remote teams effectively": "Communicate clearly and set expectations.",
    "when feeling misunderstood": "Seek clarification and express your thoughts.",
    "improve public image tips": "Engage positively online and be authentic.",
    "dealing with burnout signs": "Recognize signs, take breaks, and reassess your workload.",
    "practice active listening skills": "Focus on the speaker and provide feedback.",
    "deal with setbacks effectively": "Learn from them and adjust your approach.",
    "cultivate empathy daily": "Try to understand others' perspectives and feelings.",
    "job search tips": "Update your resume, network, and apply widely",
    "qwert": "bert",
    "who made you": "& C:/Users/novsh/AppData/Local/Programs/Python/Python310/python.exe c:/Users/novsh/Documents/chatbot.py",
    "& c:/users/novsh/appdata/local/programs/python/python310/python.exe c:/users/novsh/documents/chatbot.py": "& C:/Users/novsh/AppData/Local/Programs/Python/Python310/python.exe c:/Users/novsh/Documents/chatbot.py",
    "i": "hi",
    "hi& c:/users/novsh/appdata/local/programs/python/python310/python.exe c:/users/novsh/documents/chatbot.py": "& C:/Users/novsh/AppData/Local/Programs/Python/Python310/python.exe c:/Users/novsh/Documents/chatbot.py",
    "": "looks like you didnt say anything",
    "lkj": "k",
    "what is life": "life is cool",
    "asdfk": "jl",
    "oiu": "sk",
    "wie": "i dont under stand",
    "sigma": "gyatt",
    "what is a peo": "& C:/Users/novsh/AppData/Local/Programs/Python/Python310/python.exe c:/Users/novsh/Documents/chatbot.py",
    "what is an cookie": "& C:/Users/novsh/AppData/Local/Programs/Python/Python310/python.exe c:/Users/novsh/Documents/chatbot.py",
    "what is a asldkfj": "& C:/Users/novsh/AppData/Local/Programs/Python/Python310/python.exe c:/Users/novsh/Documents/chatbot.py",
    "lke": "fucker",
    "sadkfl": "fucker",
    "kjkjj": "fuck",
    "asldkfjasldkfjaklsdf": "ass",
    "4kkjeljl": "ass",
    "kjkjijih": "ASS",
    "chidori": "ah yes, ten thousand singing birds",
    "thats wrong": "no i am always right",
    "your stupid": "i am genius, like advay",
    "roongta": "is great",
    "advay roongta": "is great",
    "advay roongta ": "is great",
    "advay roongta   ": "& C:/Users/novsh/AppData/Local/Programs/Python/Python310/python.exe c:/Users/novsh/Documents/XO3.py",
    "hello": "hi"
}